
# Сумма покупок. Пользователь вводит поочередно название товара, цену за единицу и кол-во купленного товара (может быть нецелым числом).
#  Пользователь может ввести произвольное кол-во товаров до тех пор, пока не введет "стоп" в качестве названия товара.
#   На основе введенных данных требуетеся:

# Заполнить и вывести на экран хеш, ключами которого являются названия товаров,
#  а значением - вложенный хеш, содержащий цену за единицу товара и кол-во купленного товара.
#  Также вывести итоговую сумму за каждый товар.

# Вычислить и вывести на экран итоговую сумму всех покупок в "корзине".

item_name =""
hash_doc={}
sum=0.to_f

while true 

print "\n Введите название товара ('stop'-окончание ввода): "
item_name = gets.to_s.chop

# выходим, если услышим пароль (по русски стоп - нипонимать ...?)
break if item_name =="stop"

# Обнуляем хеш по товару
hash_item={}

# вводим данные
print "\n Введите цену за единицу : "
       
if (item_price = gets.to_f).zero?
	system "clear"
	puts "Цена не может быть нулевой!" 
	next
end

print "\n Введите количество товара : "

if (item_quantity = gets.to_f).zero?
	system "clear"
	puts "Количество не может быть нулевым!" 
	next
end

# Формируем вложенный хеш
hash_item[item_price]=item_quantity

# Формируем внешний хеш
hash_doc[item_name] = hash_item

# Очищаем экран
system "clear"
print "\n --------------- : "
print "\n Следующий товар : "
print "\n --------------- : "

end

print "\n --------------- : "

 hash_doc.each { |i_name, i_val| 
 	puts "\n стоимость  #{i_name} составляет #{(i_val.keys[0] * i_val.values[0]).round(2)} (цена: #{i_val.keys[0]} , количество - #{i_val.values[0]})"
 	sum+=(i_val.keys[0] * i_val.values[0])
 	 }

print "\n --------------- : "
print "\n Итого по накладной: #{sum.round(2)}"


