# encode UTF-8


# Прямоугольный треугольник.
#  Программа запрашивает у пользователя 3 стороны треугольника и определяет,
# является ли треугольник прямоугольным, используя теорему Пифагора2 и выводит результат на экран.
# Также, если треугольник является при этом равнобедренным (т.е. у него равны любые 2 стороны),
#  то дополнитьельно выводится информация о том, что треугольник еще и равнобедренный.
# Подсказка: чтобы воспользоваться теоремой Пифагора, нужно сначала найти самую длинную сторону (гипотенуза)
#     и сравнить ее значение в квадрате с суммой квадратов двух остальных сторон.
# Если все 3 стороны равны, то треугольник равнобедренный и равносторонний, но не прямоугольный




def check_sq sides
 # c**2= a**2+b**2
	sides[0]==Math.sqrt(sides[1]**2+sides[2]**2)
end

sides = []

print "\n Введите сторону (a) треугольника: "
a = gets.to_f       
sides << a

print "\n Введите сторону (b) треугольника: "
b = gets.to_f       
sides << b

print "\n Введите сторону (c) треугольника: "
c = gets.to_f       
sides << c
puts "\n--------------\n"


print "Треугольник с заданными сторонами - "
print case sides.uniq.length
   	when 1
  	"равносторонний"
	when 2
  	"равнобедренный"
end

print " #{check_sq(sides.reverse) ? ", прямоугольный" : ", не прямоугольный"}"

