# Квадратное уравнение (усложненное задание). Пользователь вводит 3 коэффициента a, b и с. Программа вычисляет дискриминант (D) 
# и корни уравнения (x1 и x2, если они есть) и выводит значения дискриминанта и корней на экран.

# При этом возможны следующие варианты:

# Если D > 0, то выводим дискриминант и 2 корня
# Если D = 0, то выводим дискриминант и 1 корень (т.к. они в этом случае равны)
# Если D < 0, то выводим дискриминант и сообщение "Корней нет"



def discrim (a,b,c)
	# Вычисляем дискриминант
	# D = b**2 - 4ac
	b**2 - 4*a*c
end

def root (a,b,d=0,z)
# Вычисляем корень уравнения по формуле
# x = ((+-)D**0.5 -b )/ 2*a
# где D = b**2 - 4ac
	(z*Math.sqrt(d)-b) / (2.*a)

rescue  =>  err
puts err.class
end


print "\n Введите коэффициент a: "
a = gets.to_f

print "\n Введите коэффициент b: "
b = gets.to_f       

print "\n Введите коэффициент c: "
c = gets.to_f       
puts "\n--------------\n"

d = discrim(a, b, c)

print "Уравнение #{a}x**2 + #{b}x + #{c}, имеет дискриминант = #{d}"

if d>0
	x1 = root(a.to_f,b.to_f,d,1)
	x2 = root(a.to_f,b.to_f,d,-1)
	puts " и два корня x1= #{x1}, x2=#{x2}"
	
	# Почему-то не работает  puts " и два корня x1= #{root(a,b,d,1)}, x2=#{root(a,b,d,-1)}"

elsif d==0
	x1 = root(a,b,d,1)
	puts " и один корень x1 = x2 =#{x1}"
else	
	puts " и не имеет корней"
end 



