# encoding: utf-8

# Сумма покупок. Пользователь вводит поочередно название товара, цену за единицу и кол-во купленного товара (может быть нецелым числом).
#  Пользователь может ввести произвольное кол-во товаров до тех пор, пока не введет "стоп" в качестве названия товара.
#   На основе введенных данных требуетеся:

# Заполнить и вывести на экран хеш, ключами которого являются названия товаров,
#  а значением - вложенный хеш, содержащий цену за единицу товара и кол-во купленного товара.
#  Также вывести итоговую сумму за каждый товар.

# Вычислить и вывести на экран итоговую сумму всех покупок в "корзине".


hash_doc = {}

while true

  print "\n Введите название товара ('stop'-окончание ввода): "
  item_name = gets.chop

# выходим, если услышим пароль (по русски стоп - нипонимать ...?)
  break if item_name == "стоп"

# вводим данные
  print "\n Введите цену за единицу : "

  if (item_price = gets.to_f).zero?
    system "clear"
    puts "Цена не может быть нулевой!"
    next
  end

  print "\n Введите количество товара : "

  if (item_quantity = gets.to_f).zero?
    system "clear"
    puts "Количество не может быть нулевым!"
    next
  end

# Формируем вложенный хеш
  hash_doc[item_name] = {price: item_price, quantity: item_quantity}

# Очищаем экран
  system "clear"
  print "\n --------------- : "
  print "\n Следующий товар : "
  print "\n --------------- : "

end

print "\n --------------- : "

totalsum = 0

hash_doc.each do |item_name, item_detail|

  price = item_detail[:price]

  quantity = item_detail[:quantity]

  sum = price * quantity

  puts "\n стоимость  #{item_name} составляет #{sum.round(2)} (цена: #{price} , количество - #{quantity})"

  totalsum += sum

end

print "\n --------------- : "
print "\n Итого по накладной: #{totalsum.round(2)}"


