# encoding: utf-8

# Сумма покупок. Пользователь вводит поочередно название товара, цену за единицу и кол-во купленного товара (может быть нецелым числом).
#  Пользователь может ввести произвольное кол-во товаров до тех пор, пока не введет "стоп" в качестве названия товара.
#   На основе введенных данных требуетеся:

# Заполнить и вывести на экран хеш, ключами которого являются названия товаров,
#  а значением - вложенный хеш, содержащий цену за единицу товара и кол-во купленного товара.
#  Также вывести итоговую сумму за каждый товар.

# Вычислить и вывести на экран итоговую сумму всех покупок в "корзине".

	hash_doc = {}
	
	totalsum = 0

while true 

print "\n Введите название товара ('stop'-окончание ввода): "
item_name = gets.chop

# выходим, если услышим пароль (по русски стоп - нипонимать ...?)
break if item_name == "стоп"

# вводим данные
print "\n Введите цену за единицу : "
       
if (item_price = gets.to_f).zero?
	system "clear"
	puts "Цена не может быть нулевой!" 
	next
end

print "\n Введите количество товара : "

if (item_quantity = gets.to_f).zero?
	system "clear"
	puts "Количество не может быть нулевым!" 
	next
end

# Формируем вложенный хеш
hash_doc[item_name] = { price: item_price, quantity: item_quantity }


# Очищаем экран
system "clear"
print "\n --------------- : "
print "\n Следующий товар : "
print "\n --------------- : "

end

print "\n --------------- : "

 hash_doc.each do |i_name, i_val| 
 	
 	cost = i_val.values[0]
 	quantity = i_val.values[1]
 	
 	sum = cost * quantity
 	
 	puts "\n стоимость  #{i_name} составляет #{sum.round(2)} (цена: #{cost} , количество - #{quantity})"

 	totalsum += sum

 end

print "\n --------------- : "
print "\n Итого по накладной: #{totalsum.round(2)}"


